---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.GenericMEPFailures.FlowDirectionMismatch
source: html/ec164586-731b-6990-0490-cda3a35cde6e.htm
---
# Autodesk.Revit.DB.BuiltInFailures.GenericMEPFailures.FlowDirectionMismatch Property

[Element Name]: It is not possible to calculate the flow since the flow direction mismatch.
 Please check flow direction on all equipment in this system.

## Syntax (C#)
```csharp
public static FailureDefinitionId FlowDirectionMismatch { get; }
```